## Estudo ETL Formula1 data jupyter notebook
 >projeto: Formula_Analitycs_One

 >propósito do script: estudar o processo de ETL para gerar as informações de requisitos de projeto no DWH

### Instalação, configuração e teste de conexão com AWS

#### 1.instalção de bibliotecas necessárias

In [ ]:
!pip install sqlalchemy
!pip install pandas
!pip install pymysql

#### 2.importe as bibliotecas necessárias

In [3]:
#importe o pymysql

import pymysql
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
from matplotlib import pyplot as plt

#### 2. criando uma conexão com a engine sqlalchemy e aws

In [4]:
##Sintaxe:
#engine = sqlalchemy.create_engine( ‘mysql+drive://usuario:senha@ip-servidor:porta/banco-de-dados‘)

try:
    engine = sqlalchemy.create_engine('mysql+pymysql://admin:mysqladmin1509@database-1.c2hbzw6k9btq.us-east-2.rds.amazonaws.com:3306/FORMULA1')
    print("Base de dados AWS conectada com sucesso!")

except Exception as err:

    print("Falha na conexão")
    print(err)

Base de dados AWS conectada com sucesso!

In [5]:
git add

On branch main
Your branch is up to date with 'origin/main'.

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	modified:   estudo-ETL-f1.ipynb

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	.ipynb_checkpoints/

no changes added to commit (use "git add" and/or "git commit -a")

#### 3.defina as variáveis de conexão com o drive pymysql e aws

In [15]:
#variáveis globais de conexão com o banco de dados Mysql on AWS

AWS_DB_HOST = 'database-1.c2hbzw6k9btq.us-east-2.rds.amazonaws.com'
AWS_DB_USER = 'admin'
AWS_DB_PASS = 'mysqladmin1509'
AWS_DB_NAME = 'FORMULA1'

#### 3.teste a conexão

In [16]:
pymysql.connect(host=AWS_DB_HOST,
                       user=AWS_DB_USER,
                       password=AWS_DB_PASS,
                       database=AWS_DB_NAME
                       )

#### 4. defina um banco de dados chamado dbF1 com conxesao pymysql

In [17]:
# executando a conexão com o banco de acordo com as variáveis de conexão 
# defina o dbF1 

dbF1 = pymysql.connect(host=AWS_DB_HOST,
                       user=AWS_DB_USER,
                       password=AWS_DB_PASS,
                       database=AWS_DB_NAME
                       )

#### 5. Teste o python para processar dados no banco usando cursor pymysql

In [18]:
# definindo um cursor

cursor = dbF1.cursor()

In [34]:
# descobrindo a versão do mysql na instancia AWS

cursor.execute("select version()")
version = cursor.fetchone()
print(version)

('8.0.20',)

### Usando a engine do sqlalchemy para mineração de dados
###### 6. Tabela Pilotos

In [30]:
# olhe a tabela de corridas
df = pd.read_sql_table('pilotos',engine)
# olhe o número de registros por coluna
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 853 entries, 0 to 852
Data columns (total 7 columns):
id_piloto               853 non-null int64
ref_piloto              853 non-null object
code_piloto             853 non-null object
primeiro_nome           853 non-null object
ultimo_nome             853 non-null object
nascimento              846 non-null datetime64[ns]
nacionalidade_piloto    853 non-null object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 30.0+ KB

In [31]:
# liste os atributos da tabela corridas

df.head()

,id_piloto,ref_piloto,code_piloto,primeiro_nome,ultimo_nome,nascimento,nacionalidade_piloto
0,1,hamilton,HAM,Lewis,Hamilton,1985-01-07,British
1,2,heidfeld,HEI,Nick,Heidfeld,1977-05-10,German
2,3,rosberg,ROS,Nico,Rosberg,1985-06-27,German
3,4,alonso,ALO,Fernando,Alonso,1981-07-29,Spanish
4,5,kovalainen,KOV,Heikki,Kovalainen,1981-10-19,Finnish

In [134]:
#junte colunas específicas para o estudo de pilotos por país

df = pd.read_sql_table('pilotos', engine, columns=["id_piloto","ref_piloto", "nacionalidade_piloto"])
df.head()

   id_piloto  ref_piloto nacionalidade_piloto
0          1    hamilton              British
1          2    heidfeld               German
2          3     rosberg               German
3          4      alonso              Spanish
4          5  kovalainen              Finnish

#### 7. Tabela campeonato_pilotos

In [104]:
# olhe a tabela de campeonato_pilotos
df = pd.read_sql_table('campeonato_pilotos',engine)
# olhe o número de registros por coluna
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28766 entries, 0 to 28765
Data columns (total 7 columns):
id_campeonato_pilotos    28766 non-null int64
id_corrida               28766 non-null int64
id_piloto                28766 non-null int64
pontos                   28766 non-null float64
posicao                  28766 non-null int64
texto_posicao            28766 non-null object
wins                     28766 non-null int64
dtypes: float64(1), int64(5), object(1)
memory usage: 1.4+ MB

In [105]:
# liste os atributos da tabela campeonato_pilotos

df.head()

,id_campeonato_pilotos,id_corrida,id_piloto,pontos,posicao,texto_posicao,wins
0,1,18,1,10.0,1,1,1
1,2,18,2,8.0,2,2,0
2,3,18,3,6.0,3,3,0
3,4,18,4,5.0,4,4,0
4,5,18,5,4.0,5,5,0